Revit 2024 API
BuiltInFailures.ExportFailures.SwitchToRasterProcessingInsteadOfVectorWarning Property
 Some of the views have been switched to raster processing though vector processing is selected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SwitchToRasterProcessingInsteadOfVectorWarning { get; }
Visual Basic
Public Shared ReadOnly Property SwitchToRasterProcessingInsteadOfVectorWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SwitchToRasterProcessingInsteadOfVectorWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ExportFailures Class
Autodesk.Revit.DB Namespace